Revit 2026 API

# ParameterSetMultiple Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static List<Parameter> SetMultiple(
	IList<Tuple<Parameter, ParameterValue>> values
)
```
```vb
Public Shared Function SetMultiple (
	values As IList(Of Tuple(Of Parameter, ParameterValue))
) As List(Of Parameter)
```
```cpp
public:
static List<Parameter^>^ SetMultiple(
	IList<Tuple<Parameter^, ParameterValue^>^>^ values
)
```
```fsharp
static member SetMultiple :
        values : IList<Tuple<Parameter, ParameterValue>> -> List<Parameter>
```

#### Parameters

values IListTupleParameter, ParameterValue

#### Return Value

ListParameter

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace